cases/expEulerGDHFoam/pitzDaily/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM Extend Project: Open source CFD        |
|  \\    /   O peration     | Version:  1.6-ext                               |
|   \\  /    A nd           | Web:      www.extend-project.de                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "2000";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
12225
(
2.03731e-05
1.92689e-05
1.82911e-05
1.74463e-05
1.67349e-05
1.61516e-05
1.56881e-05
1.53341e-05
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           uniform 0.000851986;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
57
(
6.05092e-05
0.000335915
0.000777117
0.00122908
0.00164488
0.00201401
0.00233633
0.00261489
...
)
;
    }
    upperWall
    {
        type            nutWallFunction;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        value           uniform 0;
    }
    lowerWall
    {
        type            nutWallFunction;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        value           nonuniform List<scalar> 
250
(
0
0
0
0
0
0
0
0
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
